{"format": "layers-model", "generatedBy": "custom-converter", "convertedBy": "TensorFlow.js Converter", "modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 126], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input"}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 30, 126], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.10.0", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "lstm/weight_0", "shape": [126, 512], "dtype": "float32", "byteOffset": 0}, {"name": "lstm/weight_1", "shape": [128, 512], "dtype": "float32", "byteOffset": 258048}, {"name": "lstm/weight_2", "shape": [512], "dtype": "float32", "byteOffset": 520192}, {"name": "lstm_1/weight_0", "shape": [128, 256], "dtype": "float32", "byteOffset": 522240}, {"name": "lstm_1/weight_1", "shape": [64, 256], "dtype": "float32", "byteOffset": 653312}, {"name": "lstm_1/weight_2", "shape": [256], "dtype": "float32", "byteOffset": 718848}, {"name": "dense/weight_0", "shape": [64, 128], "dtype": "float32", "byteOffset": 719872}, {"name": "dense/weight_1", "shape": [128], "dtype": "float32", "byteOffset": 752640}, {"name": "batch_normalization/weight_0", "shape": [128], "dtype": "float32", "byteOffset": 753152}, {"name": "batch_normalization/weight_1", "shape": [128], "dtype": "float32", "byteOffset": 753664}, {"name": "batch_normalization/weight_2", "shape": [128], "dtype": "float32", "byteOffset": 754176}, {"name": "batch_normalization/weight_3", "shape": [128], "dtype": "float32", "byteOffset": 754688}, {"name": "dense_1/weight_0", "shape": [128, 64], "dtype": "float32", "byteOffset": 755200}, {"name": "dense_1/weight_1", "shape": [64], "dtype": "float32", "byteOffset": 787968}, {"name": "batch_normalization_1/weight_0", "shape": [64], "dtype": "float32", "byteOffset": 788224}, {"name": "batch_normalization_1/weight_1", "shape": [64], "dtype": "float32", "byteOffset": 788480}, {"name": "batch_normalization_1/weight_2", "shape": [64], "dtype": "float32", "byteOffset": 788736}, {"name": "batch_normalization_1/weight_3", "shape": [64], "dtype": "float32", "byteOffset": 788992}, {"name": "dense_2/weight_0", "shape": [64, 8], "dtype": "float32", "byteOffset": 789248}, {"name": "dense_2/weight_1", "shape": [8], "dtype": "float32", "byteOffset": 791296}]}]}